package love.yinlin.data.rachel.literal

val AppPrivacyPolicy = """
银临茶舍是银临粉丝自制的 App，一个集资讯、听歌、美图、论坛、社交于一体的小银子聚集地。
我们非常重视用户的隐私保护，银临茶舍绝不会在未经您允许的情景下收集您的任何隐私内容。
如果您不同意以下隐私政策，您应立即停止使用或访问我们的产品和服务。
我们可能会不定期更新 App 隐私政策，您可以随时访问本页面查询最新的隐私政策。

## 权限列表 ##

1. 媒体权限：用于上传相册中的照片发表主题。注：App 并不需要文件存储读写权限！
2. 相机权限：用于扫描银临茶舍的用户个人资料卡的二维码。
3. 悬浮窗权限：用于显示桌面歌词。注：App 并不需要通知权限！
4. 应用安装权限：用于 App 的在线升级。

## 收集数据 ##

1. 日志信息：App 崩溃时产生的错误信息，便于我们定位、修复 Bug 并完善 App 的各项功能。

2. 个人信息：仅收集您在银临茶舍中注册的账号及相关信息，我们承诺不会向任何第三方共享、转让您的个人数据，并将采取一切合理可行的安全措施来保障您的个人数据安全。

## 存储数据 ##

App 不需要任何文件存储读写权限，所有数据和文件均存储在 App 内部存储或缓存中，所有数据或文件均会随着 App 卸载而被删除，请您注意保护数据并经常进行数据的云备份。

1. 曲库 Mod 文件
2. 歌单
3. 微博关注列表
4. 用户登录信息
5. App 配置

## 未成年人保护 ##

我们非常重视对未成年人个人信息的保护。
根据相关法律法规，收集、使用未满 14 周岁的未成年人的个人信息，需由监护人授权同意。
收集、使用已满 14 周岁但未满 18 周岁的未成年人的个人信息，可由监护人授权同意或自行授权同意。
""".trimIndent()